import z from "zod";

export const LoginSchema = z.object({
  username: z
    .string({
      error: "نام کاربری اجباری می‌باشد",
    })
    .trim()                              // حذف فضای خالی ابتدا و انتها
    .min(1, "لطفا نام کاربری خود را وارد نمایید")
    .max(50, "نام کاربری نمی‌تواند بیشتر از ۵۰ کاراکتر باشد"), // اختیاری

  password: z
    .string({
      error: "لطفا گذرواژه را وارد نمایید",
    })
    .trim()
    .min(8, "گذرواژه باید حداقل ۸ کاراکتر باشد")
    .max(100, "گذرواژه نمی‌تواند بیشتر از ۱۰۰ کاراکتر باشد"), // اختیاری
});